Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.Insert Method
 Inserts a new analysis model into the Tekla Structures model. The AnalysisModelName has to be set.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert()
Public Sub Insert
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace